{
	"cs229":"CS229 is the machine learning class at Stanford that I took with Professor Andrew Ng. For our final project we organized ourselves into groups of three and were tasked with applying the machine learning techniques we learned to a topic of our choice. We took a data set from the UCI machine learning repository on thoracic surgery patients. We tried to make predictions on life expectancy of people post-surgery to see if we could identify high risk patients. Overall the results were pretty good, and the project was a cool application of the material with easy to see real world benefits. Take a look at the pdf writeup for more info! ",

	"cs224w": "CS224W is the social network analysis class at Stanford. For our project we were asked to find and analyze a network and extract some interesting facts or properties about that network. We asked CrunchBase for their data dump about all of the startup funding. They gave us a huge data set to work with, and our project ended up being a link prediction project in a bipartite graph. We seperated the VC firms from companies and looked at edges between them, which represent the fact that that VC firm had funded that startup. Take a look ad the writeup for a more in depth analysis.",

	"cs221": "CS221 is the introduction to artificial intelligence class at Stanford, taught by Professor Percy Liang. It is a sampler course of a lot of topics in artificial intelligence, and ends in an project that applies of one of those topics. We chose the very current (at the time) topic of the intersection of sports betting and fantasy football, FanDuel. We tried to see if we could generate lineups to enter into FanDuel based on previous players scores and statistics. Take a look at the writeup for a bit more in depth explanation.",

	"dowjones": "This was a simple little project I created just to run some of the basic classifiers in sklearn on the Dow Jones market data. It runs Linear Regression and SVM as the classifiers. It uses next weeks closing price as the label.After training (on 500 of the 700 examples), it tests on the last 200. It loops through them and predicts on those, and only if we predict an increase in the price (that is next weeks close is higher than this weeks close), we count it as a \"buy\" and will add it to our money spent, and we add the next weeks close price to the money we have at the end."
 }
